# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
# import libraries here
import numpy as np
import pandas as pd
import seaborn as sns

c:\Users\marci\.conda\envs\danalysis\lib\site-packages\scipy\__init__.py:146: UserWarning: A NumPy version >=1.16.5 and <1.23.0 is required for this version of SciPy (detected version 1.23.5
  warnings.warn(f"A NumPy version >={np_minversion} and <{np_maxversion}"

# Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [2]:
# your code here
df = pd.read_csv("Temp_States.csv")

#### Print `temp`.

In [3]:
# your code here
df.head()

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [4]:
# your code here
df.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [5]:
"""
your comments here
"""

'\nyour comments here\n'

#### Select the rows where state is New York.

In [6]:
df.State.unique()

array(['New York', 'Connecticut', 'New Jersey'], dtype=object)

In [7]:
# your code here
df_ny = df[df.State == "New York"]
df_ny

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [8]:
# your code here
df_ny['Temperature'].mean()

10.74074074074074

#### Which states and cities have a temperature above 15 degrees Celsius?

In [9]:
# your code here
df[df.Temperature > 15]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [10]:
# your code here
df[df.Temperature > 15].loc[:,["City"]]

       City
0       NYC
3  Hartford
5    Treton
6    Newark

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [11]:
# your code here
df[(df.Temperature > 15)&(df.Temperature<20)]

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222

#### Find the mean and standard deviation of the temperature of each state.

In [12]:
# your code here
df.groupby("State").agg(["mean","std"])

C:\Users\marci\AppData\Local\Temp\ipykernel_976\4016916218.py:2: FutureWarning: ['City'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  df.groupby("State").agg(["mean","std"])

            Temperature
                   mean       std
State
Connecticut   15.833333  1.964186
New Jersey    21.111111  1.571348
New York      10.740741  8.133404

#  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [13]:
# your code here
df = pd.read_csv("Employees.csv")
df.head()

  Department Education      Title      Name  Years  Salary
0      Admin    Master  associate     David      4      58
1         IT    Master  associate    Thomas      7      45
2      Admin    Master  associate     Diana     10      52
3      Admin    Master         VP  Manuella     15      33
4      Sales    Master    Analyst     Carla      6      38

#### Explore the data types of the `employees` dataframe. Comment your results.

In [14]:
# your code here
df.dtypes

Department    object
Education     object
Title         object
Name          object
Years          int64
Salary         int64
dtype: object

In [15]:
"""
your comments here
"""

'\nyour comments here\n'

#### What's the average salary in this company?

In [16]:
# your code here
df["Salary"].mean()

73.528

#### What's the highest salary?

In [17]:
# your code here
df["Salary"].max()

120

#### What's the lowest salary?

In [18]:
# your code here*
df["Salary"].min()

30

#### Who are the employees with the lowest salary?

In [19]:
# your code here
df.sort_values(by="Salary").iloc[:10]

    Department Education      Title      Name  Years  Salary
106      Admin  Bachelor  associate      Luke      4      30
214      Sales    Master         VP      Neil     11      30
27          IT  Bachelor    Analyst      Sean     12      30
128      Sales       PhD         VP      Adam      8      30
139      Sales       PhD    Analyst      Rick     11      30
266         HR       PhD  associate    Marcel     10      30
452         IT  Bachelor    Analyst  Augustin     13      30
333         IT    Master    Analyst    Edward      5      31
243         HR       PhD  associate      Chad      5      31
47       Admin  Bachelor         VP   Melissa      8      31

#### Find all the information about an employee called David.

In [20]:
# your code here
david = df[df.Name == "David"]
david

    Department Education      Title   Name  Years  Salary
0        Admin    Master  associate  David      4      58
124         IT  Bachelor         VP  David      3      31

#### Could you return only David's salary?

In [21]:
# your code here
david.Salary

0      58
124    31
Name: Salary, dtype: int64

#### Print all the rows where job title is associate.

In [22]:
# your code here
df[df.Title == "associate"]

    Department Education      Title      Name  Years  Salary
0        Admin    Master  associate     David      4      58
1           IT    Master  associate    Thomas      7      45
2        Admin    Master  associate     Diana     10      52
7           HR    Master  associate     Carol     14      53
8        Admin       PhD  associate      Jean      8      50
..         ...       ...        ...       ...    ...     ...
477         HR       PhD  associate   Phillip     11     113
486         IT  Bachelor  associate       Jay     14      58
487         HR    Master  associate  Patricia     10     110
491      Admin       PhD  associate     Alice      8      37
494      Sales  Bachelor  associate   Vanessa     11     118

[158 rows x 6 columns]

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [23]:
# Method 1
# your code here
df.head(3)

  Department Education      Title    Name  Years  Salary
0      Admin    Master  associate   David      4      58
1         IT    Master  associate  Thomas      7      45
2      Admin    Master  associate   Diana     10      52

In [24]:
# Method 2
# your code here
df.iloc[:3]

  Department Education      Title    Name  Years  Salary
0      Admin    Master  associate   David      4      58
1         IT    Master  associate  Thomas      7      45
2      Admin    Master  associate   Diana     10      52

#### Find the employees whose title is associate and whose salary is above 55.

In [25]:
# your code here
df[(df.Title == "associate")&(df.Salary > 55)]

    Department Education      Title      Name  Years  Salary
0        Admin    Master  associate     David      4      58
9        Admin    Master  associate    Kareem      3     104
10       Admin    Master  associate   Cynthia      1     114
16       Admin  Bachelor  associate    Shanon      1      99
18       Admin  Bachelor  associate     Megan      9      79
..         ...       ...        ...       ...    ...     ...
476      Admin       PhD  associate      Greg      8      93
477         HR       PhD  associate   Phillip     11     113
486         IT  Bachelor  associate       Jay     14      58
487         HR    Master  associate  Patricia     10     110
494      Sales  Bachelor  associate   Vanessa     11     118

[104 rows x 6 columns]

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [26]:
# your code here
df.groupby("Years").mean().sort_values(by='Salary',ascending=False)

C:\Users\marci\AppData\Local\Temp\ipykernel_976\1016349005.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby("Years").mean().sort_values(by='Salary',ascending=False)

          Salary
Years
4      77.129032
9      76.741935
1      75.863636
2      75.857143
11     74.866667
3      74.571429
5      73.857143
7      73.840000
12     73.454545
10     73.351351
6      72.382353
13     71.935484
14     70.968750
15     69.758621
8      64.250000

####  What is the average salary per title?

In [27]:
# your code here
df.groupby("Title")["Salary"].mean()

Title
Analyst      73.703911
VP           72.907975
associate    73.968354
Name: Salary, dtype: float64

####  Find the salary quartiles.

In [28]:
# your code here
df.describe().loc[["25%","50%","75%"],"Salary"]

25%    50.0
50%    72.0
75%    97.0
Name: Salary, dtype: float64

#### Is the mean salary different per gender?

In [29]:
# your code here
df.groupby("Name").mean()

C:\Users\marci\AppData\Local\Temp\ipykernel_976\603250082.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.mean is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby("Name").mean()

               Years  Salary
Name
 Beverly    4.000000    78.0
Adam        8.666667    63.0
Alan       14.000000    63.0
Alejandra  13.000000    71.0
Alex       14.000000    78.0
...              ...     ...
Wesley     10.333333    84.0
Will        5.000000    79.0
Winston     8.250000    76.5
Yin         3.000000    68.0
Zach        8.500000    57.5

[201 rows x 2 columns]

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [32]:
# your code here
df.groupby("Department").agg(["min","max","mean"])["Salary"]

C:\Users\marci\AppData\Local\Temp\ipykernel_976\603208733.py:2: FutureWarning: ['Education', 'Title', 'Name'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  df.groupby("Department").agg(["min","max","mean"])["Salary"]

            min  max       mean
Department
Admin        30  120  76.325203
HR           30  119  74.237705
IT           30  120  70.671642
Sales        30  120  73.132231

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [37]:
# your code here
grouped_df = df.groupby("Department").agg(["min","max"])["Salary"]
grouped_df["range"] = grouped_df["max"]-grouped_df["min"]
grouped_df

            min  max  range
Department
Admin        30  120     90
HR           30  119     89
IT           30  120     90
Sales        30  120     90

# Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here